---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.MessageBoxData
source: html/7c137803-fd14-c23d-14ee-a2b25b0297be.htm
---
# MessageBoxData Methods

Causes the object to release immediately any resources it may be utilizing.